Repository: Spacebody/Vela
Catalog: Vela/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

# providers.inspector.controllerSource.help
source: Values are read from the committed Mihomo provider catalog.
zh_hans: 这些值读取自已提交的 Mihomo 供应商目录。

# providers.inspector.empty.description
source: Select a provider to inspect freshness, source, and actions.
zh_hans: 选择一个供应商，以检查新鲜度、来源和操作。

# providers.inspector.empty.title
source: Provider Details
zh_hans: 供应商详情

# providers.inspector.failure.description
source: No provider snapshot is available.
zh_hans: 没有可用的供应商快照。

# providers.inspector.failure.title
source: Provider Details Unavailable
zh_hans: 供应商详情不可用

# providers.inspector.freshness
source: Freshness
zh_hans: 新鲜度

# providers.inspector.freshness.title
source: Freshness and Update Evidence
zh_hans: 新鲜度与更新证据

# providers.inspector.healthCheck.title
source: Health Check
zh_hans: 健康检查

# providers.inspector.lastGoodCount
source: Last Good Item Count
zh_hans: 上次正常项目数

# providers.inspector.nodes.count.format
source: %lld nodes
zh_hans: %lld 个节点

# providers.inspector.nodes.empty
source: No nodes reported
zh_hans: 未报告节点

# providers.inspector.nodes.title
source: Nodes
zh_hans: 节点

# providers.inspector.payload.count.format
source: %lld entries
zh_hans: %lld 个条目

# providers.inspector.payload.notReported
source: Not reported
zh_hans: 未报告

# providers.inspector.payload.title
source: Payload
zh_hans: 载荷

# providers.inspector.phase
source: Current Phase
zh_hans: 当前阶段

# providers.inspector.proxy.count.format
source: Proxy Provider · %lld items
zh_hans: 代理供应商 · %lld 个项目

# providers.inspector.proxy.subtitle
source: Proxy provider
zh_hans: 代理供应商

# providers.inspector.proxySummary
source: Proxy Summary
zh_hans: 代理摘要

# providers.inspector.redaction
source: Credentials, private paths, and full source URLs are not displayed.
zh_hans: 不显示凭据、私有路径和完整来源 URL。

# providers.inspector.rule.count.format
source: Rule Provider · %lld rules
zh_hans: 规则供应商 · %lld 条规则

# providers.inspector.rule.subtitle
source: Rule provider
zh_hans: 规则供应商

# providers.inspector.ruleSummary
source: Rule Summary
zh_hans: 规则摘要

# providers.inspector.source.title
source: Source
zh_hans: 来源

# providers.inspector.subscriptionUsage.title
source: Subscription Usage
zh_hans: 订阅用量

# providers.kind.proxy
source: Proxy
zh_hans: 代理

# providers.kind.proxyProvider
source: Proxy Provider
zh_hans: 代理供应商

# providers.kind.rule
source: Rule
zh_hans: 规则

# providers.kind.ruleProvider
source: Rule Provider
zh_hans: 规则供应商

# providers.loading.description
source: Reading the committed provider catalog.
zh_hans: 正在读取已提交的供应商目录。

# providers.loading.title
source: Loading Providers
zh_hans: 正在载入供应商

# providers.node.status.down
source: Down
zh_hans: 不可用

# providers.node.status.up
source: Up
zh_hans: 可用

# providers.recovery.connecting
source: Connecting…
zh_hans: 正在连接…

# providers.recovery.controller.description
source: Vela cannot reach the runtime provider service right now.
zh_hans: Vela 当前无法访问配置供应商服务。

# providers.recovery.controller.title
source: Connection Service Unavailable
zh_hans: 连接服务不可用

# providers.recovery.diagnostics.hint
source: Open Diagnostics to inspect the Controller and Mihomo state.
zh_hans: 打开诊断以检查 Controller 和 Mihomo 状态。

# providers.recovery.empty.description
source: Choose or edit a configuration before loading proxy and rule providers.
zh_hans: 请先选择或编辑配置，再加载代理和规则供应商。

# providers.recovery.empty.title
source: No Provider Configuration
zh_hans: 没有供应商配置

# providers.recovery.fetch.description
source: The Controller did not return a readable provider snapshot. Reload the catalog or inspect Diagnostics.
zh_hans: Controller 未返回可读取的供应商快照。请重新加载或打开诊断。

# providers.recovery.fetch.title
source: Provider Data Could Not Be Loaded
zh_hans: 无法加载供应商数据

# providers.recovery.loading
source: Loading…
zh_hans: 正在加载…

# providers.recovery.mihomo.description
source: Vela will restart its connection service before loading providers.
zh_hans: Vela 会先重新准备连接服务，再加载配置供应商。

# providers.recovery.mihomo.title
source: Connection Service Is Not Ready
zh_hans: 连接服务尚未就绪

# providers.recovery.openWorkbench
source: Open Workbench
zh_hans: 打开配置工作台

# providers.recovery.openWorkbench.hint
source: Open Configuration Workbench to choose or edit a configuration.
zh_hans: 打开配置工作台以选择或编辑配置。

# providers.recovery.reconnect
source: Reconnect
zh_hans: 重新连接

# providers.recovery.reconnect.hint
source: Try to reconnect to Mihomo Controller and reload providers.
zh_hans: 尝试重新连接 Mihomo Controller 并加载供应商。

# providers.recovery.reload
source: Reload
zh_hans: 重新加载

# providers.recovery.reload.hint
source: Request a fresh provider snapshot from Mihomo Controller.
zh_hans: 向 Mihomo Controller 请求新的供应商快照。

# providers.recovery.starting
source: Preparing…
zh_hans: 正在准备…

# providers.recovery.startMihomo
source: Retry
zh_hans: 重试

# providers.recovery.startMihomo.hint
source: Restart Vela's connection service and load providers.
zh_hans: 重新准备 Vela 的连接服务并加载供应商。

# providers.search.clear
source: Clear Search
zh_hans: 清除搜索

# providers.search.empty.description
source: No providers match the current search and kind filter.
zh_hans: 没有供应商匹配当前搜索和类型筛选。

# providers.search.empty.title
source: No Matching Providers
zh_hans: 没有匹配的供应商

# providers.search.prompt
source: Name, kind, source, or status
zh_hans: 名称、类型、来源或状态

# providers.selection.none
source: No Provider Selected
zh_hans: 未选择供应商

# providers.snapshot.stale.banner.title
source: Showing Saved Provider Data
zh_hans: 正在显示已保存的供应商数据

# providers.snapshot.stale.description
source: Showing the last provider snapshot while live Controller data is unavailable.
zh_hans: Controller 实时数据不可用，当前显示上一次供应商快照。

# providers.snapshot.stale.title
source: Provider Details May Be Out of Date
zh_hans: 供应商详情可能已过期

# providers.status.degraded
source: Degraded
zh_hans: 已降级

# providers.status.failed
source: Failed
zh_hans: 失败

# providers.status.healthy
source: Healthy
zh_hans: 健康

# providers.status.loaded
source: Loaded
zh_hans: 已载入

# providers.status.ready
source: Ready
zh_hans: 就绪

# providers.status.skipped
source: Skipped
zh_hans: 已跳过

# providers.status.unknown
source: Unknown
zh_hans: 未知

# providers.status.updated
source: Updated
zh_hans: 已更新

# providers.status.updating
source: Updating
zh_hans: 正在更新

# providers.status.updatingTargets
source: Updating Providers
zh_hans: 正在更新供应商

# providers.status.working
source: Working
zh_hans: 正在处理

# providers.usage.available
source: Available
zh_hans: 可用

# providers.usage.dataUsed
source: Data Used
zh_hans: 已用流量

# providers.usage.limitReached
source: Limit Reached
zh_hans: 已达上限

# providers.usage.ofTotal.format
source: of %@
zh_hans: 总计 %@

# providers.usage.totalUnavailable
source: No total quota reported
zh_hans: 未报告总配额

# providers.value.notReported
source: Not Reported
zh_hans: 未报告

# proxies.action.changeProxy
source: Change Proxy
zh_hans: 切换代理节点

# proxies.action.clearSearch
source: Clear Search
zh_hans: 清除搜索

# proxies.action.hideInspector
source: Hide proxy group details
zh_hans: 隐藏代理组详情

# proxies.action.openConfiguration
source: Open Configuration
zh_hans: 打开配置工作台

# proxies.action.openDiagnostics
source: Open Diagnostics
zh_hans: 打开诊断

# proxies.action.refresh
source: Refresh
zh_hans: 刷新

# proxies.action.refresh.help
source: Refresh proxy groups and current selections
zh_hans: 刷新代理组和当前选择

# proxies.action.retry
source: Retry
zh_hans: 重试

# proxies.action.showInspector
source: Show proxy group details
zh_hans: 显示代理组详情

# proxies.action.testGroup
source: Test Group
zh_hans: 测试代理组

# proxies.action.testGroup.help
source: Test every candidate in the selected proxy group
zh_hans: 测试所选代理组中的所有候选节点

# proxies.action.testSelected
source: Test Selected Proxy
zh_hans: 测试当前代理

# proxies.action.toggleInspector
source: Toggle Inspector
zh_hans: 切换检查器

# proxies.action.unavailable.busy
source: Wait for the current proxy operation to finish
zh_hans: 请等待当前代理操作完成

# proxies.action.useProxy.format
source: Use %@
zh_hans: 使用 %@

# proxies.column.currentProxy
source: Current Proxy
zh_hans: 当前代理

# proxies.column.group
source: Group
zh_hans: 代理组

# proxies.column.latency
source: Latency
zh_hans: 延迟

# proxies.column.status
source: Status
zh_hans: 状态

# proxies.column.strategy
source: Strategy
zh_hans: 策略

# proxies.groups.filter
source: Filter Proxy Groups
zh_hans: 筛选代理组

# proxies.groups.filter.all
source: All Groups
zh_hans: 全部代理组

# proxies.groups.filter.needsAttention
source: Needs Attention
zh_hans: 需处理

# proxies.groups.sort
source: Sort Proxy Groups
zh_hans: 代理组排序

# proxies.groups.sort.configuration
source: Configuration Order
zh_hans: 配置顺序

# proxies.groups.sort.name
source: Name
zh_hans: 名称

# proxies.inspector.actions
source: Actions
zh_hans: 操作

# proxies.inspector.automaticStrategy
source: Automatic Strategy
zh_hans: 自动策略

# proxies.inspector.candidateCount.format
source: %lld candidates
zh_hans: %lld 个候选节点

# proxies.inspector.candidates
source: Candidates
zh_hans: 候选节点

# proxies.inspector.candidatesUnavailable
source: Candidate details unavailable
zh_hans: 候选节点详情不可用

# proxies.inspector.currentSelection
source: Current Selection
zh_hans: 当前选择

# proxies.inspector.details
source: Proxy Group Details
zh_hans: 代理组详情

# proxies.inspector.healthEvidence
source: Health Evidence
zh_hans: 健康证据

# proxies.inspector.phase
source: Phase
zh_hans: 阶段

# proxies.inspector.requestedProxy
source: Requested Proxy
zh_hans: 请求的代理

# proxies.inspector.samples
source: Samples
zh_hans: 样本

# proxies.inspector.select.detail
source: Select a proxy group to inspect its candidates and health.
zh_hans: 请选择代理组以查看候选节点和健康状态。

# proxies.inspector.snapshotAge
source: Snapshot Age
zh_hans: 快照时间

# proxies.inspector.source
source: Source
zh_hans: 来源

# proxies.inspector.strategySource
source: Strategy / Source
zh_hans: 策略 / 来源

# proxies.inspector.subtitle.format
source: %@ · %lld candidates
zh_hans: %@ · %lld 个候选节点

# proxies.inspector.type
source: Type
zh_hans: 类型

# proxies.phase.applying
source: Applying
zh_hans: 应用中

# proxies.search.prompt
source: Group, current proxy, or strategy
zh_hans: 代理组、当前代理或策略

# proxies.state.applying
source: Applying proxy selection
zh_hans: 正在应用代理选择

# proxies.state.applying.detail
source: The committed selection remains visible until Mihomo confirms the requested proxy.
zh_hans: 在 Mihomo 确认请求的代理前，仍显示已提交的当前选择。

# proxies.state.catalogUnavailable
source: Proxy catalog unavailable
zh_hans: 代理目录不可用

# proxies.state.empty
source: No Proxy Groups
zh_hans: 没有代理组

# proxies.state.empty.detail
source: The current configuration does not expose any proxy groups.
zh_hans: 当前配置没有提供代理组。

# proxies.state.failure
source: Proxy Groups Unavailable
zh_hans: 代理组不可用

# proxies.state.failure.detail
source: Mihomo did not return a usable proxy catalog.
zh_hans: Mihomo 未返回可用的代理目录。

# proxies.state.loading
source: Loading Proxy Groups
zh_hans: 正在载入代理组

# proxies.state.loading.detail
source: Reading the authoritative proxy state from Mihomo.
zh_hans: 正在从 Mihomo 读取权威代理状态。

# proxies.state.noMatches
source: No Matching Proxy Groups
zh_hans: 没有匹配的代理组

# proxies.state.noMatches.detail
source: Clear the search to show available proxy groups.
zh_hans: 清除搜索以显示可用代理组。

# proxies.state.offline
source: Controller offline
zh_hans: 控制器离线

# proxies.state.offline.detail
source: Proxy groups become available after Mihomo reconnects.
zh_hans: Mihomo 重新连接后即可使用代理组。

# proxies.state.partialFailure
source: Some proxy data could not be refreshed
zh_hans: 部分代理数据无法刷新

# proxies.state.partialFailure.detail
source: Vela is showing the last confirmed proxy groups.
zh_hans: Vela 正在显示上次确认的代理组。

# proxies.state.refreshing
source: Refreshing proxy groups
zh_hans: 正在刷新代理组

# proxies.state.refreshing.detail
source: The last confirmed snapshot remains available during refresh.
zh_hans: 刷新期间继续显示上次确认的快照。

# proxies.state.stale
source: Proxy data is stale
zh_hans: 代理数据已过期

# proxies.state.stale.detail
source: Review the last confirmed snapshot and refresh when the Controller is available.
zh_hans: 请查看上次确认的快照，并在控制器可用时刷新。

# proxies.status.degraded
source: Degraded
zh_hans: 性能下降

# proxies.status.healthy
source: Healthy
zh_hans: 健康

# proxies.status.pending
source: Pending
zh_hans: 处理中

# proxies.status.permissionRequired
source: Permission Required
zh_hans: 需要权限

# proxies.status.ready
source: Ready
zh_hans: 就绪

# proxies.status.stale
source: Stale
zh_hans: 已过期

# proxies.status.unavailable
source: Unavailable
zh_hans: 不可用

# proxies.status.unknown
source: Unknown
zh_hans: 未知

# proxies.value.current
source: Current
zh_hans: 当前

# proxies.value.none
source: None
zh_hans: 无

# proxies.value.notAvailable
source: Not available
zh_hans: 不可用

# proxies.value.pinned
source: Pinned
zh_hans: 已固定

# proxies.value.requested
source: Requested
zh_hans: 已请求

# proxies.value.unavailable
source: Unavailable
zh_hans: 不可用

# releaseCandidate.architectureFreeze
source: RC Architecture Freeze
zh_hans: RC 架构冻结

# releaseCandidate.auditEvidence
source: Audit Evidence
zh_hans: 审计证据

# releaseCandidate.auditEvidence.protectedArtifacts
source: Audit evidence is not embedded in the app. For a promoted release, verify the public summary in its separately distributed protected artifact set.
zh_hans: 审计证据未嵌入 App。若此候选版本获准发布，请在单独分发的受保护制品集中验证公开摘要。

# releaseCandidate.auditEvidence.unavailable
source: Protected release evidence is unavailable for this build.
zh_hans: 此构建没有可用的受保护发布证据。

# releaseCandidate.automationProtocol
source: Automation Protocol
zh_hans: 自动化协议

# releaseCandidate.buildChannel
source: Build Channel
zh_hans: 构建通道

# releaseCandidate.channel.stable
source: Stable
zh_hans: 稳定版

# releaseCandidate.dataSchema
source: Data Schema
zh_hans: 数据架构

# releaseCandidate.helperProtocol
source: Helper Protocol
zh_hans: Helper 协议

# releaseCandidate.knownLimitations
source: Known Limitations
zh_hans: 已知限制

# releaseCandidate.license.sparkle
source: Sparkle License
zh_hans: Sparkle 许可证

# releaseCandidate.license.thirdPartyNotices
source: Third-Party Notices
zh_hans: 第三方声明

# releaseCandidate.license.view
source: View License
zh_hans: 查看许可证

# releaseCandidate.license.yams
source: Yams License
zh_hans: Yams 许可证

# releaseCandidate.notice.view
source: View Notices
zh_hans: 查看声明

# releaseCandidate.notImplemented
source: Not implemented
zh_hans: 未实现

# releaseCandidate.platform
source: Platform
zh_hans: 平台

# releaseCandidate.prerelease
source: Release Label
zh_hans: 发布标识

# releaseCandidate.publicContract
source: RC Public Contract
zh_hans: RC 公共契约

# releaseCandidate.sbom.external
source: Not embedded in the app; verify it in the separately distributed artifacts for a promoted release.
zh_hans: 未嵌入 App；若此候选版本获准发布，请在单独分发的制品中验证。

# releaseCandidate.unavailable
source: Unavailable
zh_hans: 不可用

# releaseCandidate.updateTrack
source: Update Track
zh_hans: 更新轨道

# resultSummary.attention.format
source: %lld of %lld operations need attention
zh_hans: %2$lld 项操作中有 %1$lld 项需要处理

# resultSummary.completed.format
source: %lld operations completed
zh_hans: 已完成 %lld 项操作

# resultSummary.retryFailed.hint
source: Retries only the operations that need attention.
zh_hans: 仅重试需要处理的操作。

# rules.accessibility.columns
source: Responsive runtime rule columns
zh_hans: 运行时规则响应式列

# rules.accessibility.increasedContrast
source: Increased contrast
zh_hans: 增强对比度

# rules.accessibility.pendingMutation
source: Pending temporary rule target and phase
zh_hans: 待处理的临时规则目标与阶段

# rules.accessibility.reduceMotion
source: Reduce motion
zh_hans: 减少动态效果

# rules.accessibility.selectedInspector
source: Selected runtime rule inspector
zh_hans: 已选择的运行时规则检查器

# rules.action.add
source: Add Rule
zh_hans: 添加规则

# rules.action.add.help
source: Add a persistent rule before subscription rules.
zh_hans: 在订阅规则之前添加一条长期保留的规则。

# rules.action.copyRedacted
source: Copy Redacted Technical Summary
zh_hans: 复制已脱敏的技术摘要

# rules.action.copyRule
source: Copy Rule
zh_hans: 复制规则

# rules.action.openConfiguration
source: Open Configuration
zh_hans: 打开配置

# rules.action.openDiagnostics.hint
source: Open guided checks for Mihomo and its Controller.
zh_hans: 打开 Mihomo 与 Controller 的引导式检查。

# rules.action.openProvider
source: Open Provider
zh_hans: 打开供应商

# rules.action.openWorkbench
source: Open Workbench
zh_hans: 打开配置工作台

# rules.action.openWorkbench.help
source: Open the exact editable source in Configuration Workbench.
zh_hans: 在配置工作台中打开可编辑的精确来源。

# rules.action.openWorkbench.recoveryHint
source: Open Configuration Workbench to choose or edit the active configuration.
zh_hans: 打开配置工作台以选择或编辑当前配置。

# rules.action.openWorkbench.unavailable
source: Exact source mapping is unavailable for this runtime rule.
zh_hans: 此运行时规则没有可用的精确来源映射。

# rules.action.refreshEvidence
source: Refresh Rule Evidence
zh_hans: 刷新规则证据

# rules.action.reload
source: Reload Rules
zh_hans: 重新加载规则

# rules.action.reload.hint
source: Request the current runtime rule snapshot from the Controller.
zh_hans: 从 Controller 请求当前运行时规则快照。

# rules.action.reload.mihomoStoppedHint
source: Start Mihomo before reloading runtime rules.
zh_hans: 请先启动 Mihomo，再重新加载运行时规则。

# rules.action.reload.pendingHint
source: A rule reload request is already in progress.
zh_hans: 规则重新加载请求正在进行中。

# rules.action.reloading
source: Reloading…
zh_hans: 正在重新加载…

# rules.column.hits
source: Hits
zh_hans: 命中

# rules.column.matchType
source: Match Type
zh_hans: 匹配类型

# rules.column.rule
source: Rule
zh_hans: 规则

# rules.column.source
source: Source / Domain
zh_hans: 来源 / 域名

# rules.column.target
source: Target
zh_hans: 目标

# rules.confidence.ambiguous
source: Ambiguous Source
zh_hans: 来源不明确

# rules.confidence.exact
source: Exact Source
zh_hans: 精确来源

# rules.confidence.stale
source: Stale Source Evidence
zh_hans: 来源证据已过期

# rules.confidence.unavailable
source: Source Unavailable
zh_hans: 来源不可用

# rules.count.filteredFormat
source: %lld of %lld rules
zh_hans: %1$lld / %2$lld 条规则

# rules.count.staleFormat
source: %lld rules · updated %@ ago
zh_hans: %1$lld 条规则 · %2$@前更新

# rules.count.totalFormat
source: %lld rules
zh_hans: %lld 条规则

# rules.duration.minutesFormat
source: %lldm
zh_hans: %lld 分钟

# rules.duration.secondsFormat
source: %llds
zh_hans: %lld 秒

# rules.empty.configuration.detail
source: The active configuration contains no runtime rules.
zh_hans: 当前配置不包含运行时规则。

# rules.empty.configuration.title
source: No Runtime Rules
zh_hans: 没有运行时规则

# rules.empty.filtered.description
source: No rules match the current search or filters.
zh_hans: 没有规则符合当前搜索或筛选条件。

# rules.empty.filtered.title
source: No Matching Rules
zh_hans: 没有匹配的规则

# rules.empty.loading.description
source: Fetching the current runtime rule table from Mihomo.
zh_hans: 正在从 Mihomo 获取当前运行时规则表。

# rules.empty.loading.title
source: Loading Rules
zh_hans: 正在载入规则

# rules.empty.runtime.description
source: The table and inspector remain ready. Start Mihomo or refresh after the Controller reconnects.
zh_hans: 表格和检查器仍可使用。请启动 Mihomo，或在 Controller 重新连接后刷新。

# rules.empty.runtime.title
source: No Runtime Rules
zh_hans: 没有运行时规则

# rules.error.configurationGenerationChanged
source: The configuration changed during the operation; the committed rules remain visible.
zh_hans: 操作期间配置发生变化；仍显示已确认的规则。

# rules.error.fetchFailed
source: Mihomo did not return the current rule list.
zh_hans: Mihomo 未返回当前规则列表。

# rules.error.operationAlreadyRunning
source: A temporary change for this rule is already in progress.
zh_hans: 此规则的临时更改正在进行中。

# rules.error.ruleNotFound
source: The selected rule no longer exists in the current configuration.
zh_hans: 所选规则已不在当前配置中。

# rules.error.title
source: Rules Unavailable
zh_hans: 规则不可用

# rules.error.toggleFailed
source: Mihomo did not confirm the temporary rule change.
zh_hans: Mihomo 未确认临时规则更改。

# rules.error.toggleUnsupported
source: This rule does not support temporary runtime toggling.
zh_hans: 此规则不支持临时运行时切换。

# rules.field.evidenceGeneration
source: Evidence Generation
zh_hans: 证据配置代次

# rules.field.lastMatched
source: Last Matched
zh_hans: 上次命中

# rules.field.matches
source: Matches
zh_hans: 命中

# rules.field.pattern
source: Pattern
zh_hans: 匹配内容

# rules.field.priority
source: Priority
zh_hans: 优先级

# rules.field.provider
source: Provider
zh_hans: 供应商

# rules.field.providerStatus
source: Provider Status
zh_hans: 供应商状态

# rules.field.proxyGroup
source: Proxy Group
zh_hans: 代理组

# rules.field.rawRule
source: Raw Rule
zh_hans: 原始规则

# rules.field.ruleName
source: Rule Name
zh_hans: 规则名称

# rules.field.runtimeIndex
source: Runtime Index
zh_hans: 运行时索引

# rules.field.sourceConfidence
source: Source Confidence
zh_hans: 来源可信度

# rules.field.sourceLayer
source: Source Layer
zh_hans: 来源层

# rules.field.sourcePointer
source: Source Pointer
zh_hans: 来源指针

# rules.filter.multiple
source: %lld filters
zh_hans: %lld 个筛选条件

# rules.filter.source.all
source: All Sources
zh_hans: 全部来源

# rules.filter.source.help
source: Filter by the exact runtime rule source.
zh_hans: 按运行时规则的精确来源筛选。

# rules.filter.source.unavailable
source: Source Unavailable
zh_hans: 来源不可用

# rules.filter.source.unavailable.help
source: The runtime rules endpoint does not expose source mapping.
zh_hans: 运行时规则接口未提供来源映射。

# rules.filter.state.any
source: Any State
zh_hans: 任意状态

# rules.filter.state.disabled
source: Disabled
zh_hans: 已停用

# rules.filter.state.enabled
source: Enabled
zh_hans: 已启用

# rules.filter.state.unsupported
source: Not Toggleable
zh_hans: 不可切换

# rules.group.count
source: %lld rules
zh_hans: %lld 条规则

# rules.group.count.singular
source: %lld rule
zh_hans: %lld 条规则

# rules.group.domain
source: Domain
zh_hans: 域名

# rules.group.final
source: Final
zh_hans: 最终规则

# rules.group.others
source: Others
zh_hans: 其他

# rules.group.process
source: Process
zh_hans: 进程

# rules.group.providerRules
source: Provider Rules
zh_hans: 规则供应商

# rules.group.statistics
source: Rule Statistics
zh_hans: 规则统计

# rules.groups.title
source: Rule Groups
zh_hans: 规则组

# rules.inspector.actions.subtitle
source: Copy, navigate, or apply a verified temporary state
zh_hans: 复制、导航或应用已验证的临时状态

# rules.inspector.actions.title
source: Actions
zh_hans: 操作

# rules.inspector.active
source: Active Rule
zh_hans: 活跃规则

# rules.inspector.empty.center.debugLabel
source: Empty rule inspector center
zh_hans: 规则检查器空状态中心

# rules.inspector.empty.noData.description
source: Full rule, runtime statistics, and provenance will appear here when data becomes available.
zh_hans: 数据可用后，此处将显示完整规则、运行时统计和来源信息。

# rules.inspector.empty.selection.description
source: Select a rule to inspect its source and routing evidence.
zh_hans: 选择一条规则，以检查其来源和路由证据。

# rules.inspector.empty.title
source: Rule Details
zh_hans: 规则详情

# rules.inspector.emptyConfiguration.detail
source: The active configuration has no runtime rule to inspect.
zh_hans: 当前配置中没有可检查的运行时规则。

# rules.inspector.failure.detail
source: Retry the runtime snapshot before inspecting source or match evidence.
zh_hans: 请先重试获取运行时快照，再检查来源或匹配证据。

# rules.inspector.failure.title
source: No Current Rule Snapshot
zh_hans: 没有当前规则快照

# rules.inspector.fallback.detail
source: This MATCH rule is evaluated after every earlier runtime rule.
zh_hans: 此 MATCH 规则会在之前的所有运行时规则之后求值。

# rules.inspector.fallback.title
source: Final Fallback Rule
zh_hans: 最终兜底规则

# rules.inspector.fullRule.subtitle
source: Runtime rule reported by Mihomo
zh_hans: Mihomo 报告的运行时规则

# rules.inspector.fullRule.title
source: Full Rule
zh_hans: 完整规则

# rules.inspector.information.subtitle
source: Runtime order and expression
zh_hans: 运行时顺序与表达式

# rules.inspector.information.title
source: Rule Information
zh_hans: 规则信息

# rules.inspector.loading.detail
source: Rule details will become available after the runtime snapshot loads.
zh_hans: 运行时快照载入后即可查看规则详情。

# rules.inspector.matches.subtitle
source: Current runtime counters
zh_hans: 当前运行时计数

# rules.inspector.matches.title
source: Match Evidence
zh_hans: 匹配证据

# rules.inspector.noFilterResults.detail
source: Clear the current search or filters to select a rule.
zh_hans: 清除当前搜索或筛选后即可选择规则。
